[{"control": "AC-1", "name": "Access Control Policy and Procedures", "Category": "Identify", "Control Description": "The organization develops, documents, and disseminates an access control policy and procedures that address purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance.", "Implementation Status": "Implemented", "answer": "Access control policies are documented in the \"Information Security Policy\" document, reviewed annually, and available to all employees on the company intranet.", "Justification Document": "Justification_AC-1.pdf"}, {"control": "PR.IP-1", "name": "Baseline Configuration", "Category": "Protect", "Control Description": "A baseline configuration of information systems and devices is created and maintained.", "Implementation Status": "Partially Implemented", "answer": "Baseline configurations exist for servers and employee workstations. However, they have not been updated to reflect the latest OS and application patches. Network device baselines are not yet established.", "Justification Document": "Justification_PR.IP-1.pdf"}, {"control": "DE.CM-1", "name": "Network Monitoring", "Category": "Detect", "Control Description": "The network is monitored to detect potential cybersecurity events.", "Implementation Status": "Implemented", "answer": "A Security Information and Event Management (SIEM) system is in place, collecting logs from critical systems. Alerts are configured for suspicious activities and monitored 24/7 by the security team.", "Justification Document": "Justification_DE.CM-1.pdf"}, {"control": "RS.RP-1", "name": "Response Planning", "Category": "Respond", "Control Description": "A response plan is in place to manage the effects of a cybersecurity incident.", "Implementation Status": "Implemented", "answer": "The \"Incident Response Plan\" is documented, and tabletop exercises are conducted quarterly to test its effectiveness. The plan includes roles, responsibilities, and communication protocols.", "Justification Document": "Justification_RS.RP-1.pdf"}, {"control": "RC.RP-1", "name": "Recovery Planning", "Category": "Recover", "Control Description": "A recovery plan is in place to restore systems and data in the event of a cybersecurity incident.", "Implementation Status": "Needs Improvement", "answer": "A disaster recovery plan exists for critical systems, with data backed up to a secondary site. However, the last full recovery test was over a year ago, and the documented Recovery Time Objective (RTO) was not met.", "Justification Document": "Justification_RC.RP-1.pdf"}]